IdeaRS.OpenModel.Beam.IdeaBeamImportSettings.DesignCode
Gets or sets the Design Code

IdeaRS.OpenModel.Beam.IdeaBeamImportSettings.CanChangeDesignCodeInWizard
Can change design code in Wizard

IdeaRS.OpenModel.Beam.IdeaBeamImportSettings.BeamFileName
Gets or sets the name of the Beam project